soapmessages/retrieveRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<env:Header>
		<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
			<sessionId>
				00DR00000000MZ6!AR4AQJF6PKt6N.TWfbblHiTw4KUFednjQmxEsnX1ltrUz12O5hINAPzgOpjmyS06SyXt6fvjdTaXVxTpFh_m8HY9O.n0Kgie
			</sessionId>
		</SessionHeader>
	</env:Header>
	<env:Body>
		<m:retrieve xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
			<m:retrieveRequest>
				<m:apiVersion>29.0</m:apiVersion>
				<m:singlePackage>false</m:singlePackage>
				<m:unpackaged xsi:type="m:Package">
					<m:types>
						<m:members>*</m:members>
						<m:name>CustomObject</m:name>
					</m:types>
					<m:version>29.0</m:version>
				</m:unpackaged>
			</m:retrieveRequest>
		</m:retrieve>
	</env:Body>
</env:Envelope>
